#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 1018                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: leenryu4 <boj.kr/u/leenryu4>                +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/1018                           #+#        #+#      #+#     #
#    Solved: 2025/08/10 17:34:21 by leenryu4      ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

#자르는 게 문제일 듯.
#추가적으로 칠해야 하는 게 젤 적게 8*8 모양을 잘라야 한다니...

# 왼쪽 최상단의 값이 b일 때/ w일 때의 이상적인 체스판을 구성해두고 이거와의 차이가 적은 것을 찾아 봐야 한다..
